Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_498-Tantra_of_the_Blue-Clad_Vajrapani-v1.tmx
Source language: bo
Languages: en

source: །ཐབ་ཁུང་རབ་དང་འབྲིང་ཐ་མ།
en: “With respect to the superior, average, and inferior hearth,

source: །རབ་ཀྱིས་མཐོ་གསུམ་འབྲིང་གིས་དོ། །ཐ་མས་མཐོ་གང་ཚད་དུ་བྱ།
en: Construct the superior one in three measures, the average in two, And the inferior in whatever measure is possible.

source: །བུད་ཤིང་ཚེར་མ་ཅན་ཤིང་གིས། །ཀུན་ཏུ་དྲག་པོ་རབ་ཏུ་བསྒྲུབ།
en: “With fuel of thorny wood, Great wrath is accomplished.

source: །བག་ཟན་ཡུངས་ཀར་མེར་བསྲེག་ཅིང་།
en: Burn dough and mustard seeds in the fire;

source: །སྡང་བའི་ལུས་ངག་ཡིད་གསུམ་རྣམས། །རྫས་ལ་བསྟིམས་ཏེ་སྦྱིན་བསྲེག་བྱ།
en: Dissolve the body, speech, and mind of the aggressor Into the substances, and make the burnt offering.

source: །འཁོར་བཅས་གནོད་སྦྱིན་མེར་བསམས་ཏེ།
en: “Imagine the retinue of yakṣas in the fire

source: །བསྲེག་པའི་རྫས་ཀྱིས་མཆོད་པའམ། །ལས་མེ་གནོད་སྦྱིན་རྫས་ཀྱིས་བྲབ།
en: And present them with the burnt substances, Or scatter the activity-fire yakṣas with the substances.

source: །གང་ལྟར་བྱས་ཀྱང་འགྲུབ་པར་འགྱུར།
en: However you do it, it will be accomplished.

source: །དེ་ཚེ་བསྟོད་པ་འདིས་ཀྱང་ནི། །རྩེ་གཅིག་སེམས་ཀྱིས་བསྟོད་པར་བྱ།
en: “At that time, also, with these words of praise Focus your mind one-pointedly and offer praise:

source: །ཧཱུྃ་ཀུན་འདུལ་མི་བཟད་གནོད་སྦྱིན་སོགས། །གདུག་པ་དཔལ་ཚ་རབ་ཏུ་འཇིགས།
en: “Hūṃ! All-conquering, terrifying yakṣa and the rest, Terrorizing with your noxious brilliant heat,

source: །ཁྲོ་བོ་རྔམ་པ་ཆེར་སྒྲོགས་པ། །འཁོར་བཅས་རྣམས་ལ་ཕྱག་འཚལ་བསྟོད།
en: Bellowing loudly with wrathful splendor. Homage and praise to you and your retinue!

source: །ཨོྃ་བཻ་ཤྲ་བ་ཎ་པུ་ཥྤེ་ཧཱུྃ་སྭཱ་ཧཱ། ཨོྃབཻ་ཤྲ་བ་ཎ་དྷུ་པེ་ཧཱུྃ་སྭཱ་ཧཱ། ཨོྃ་བཻ་ཤྲ་བ་ཎ་དཱི་པྃ་ཧཱུྃ་སྭཱ་ཧཱ། ཨོྃ་བཻ་ཤྲ་བ་ཎ་གན་དྷེ་ཧཱུྃ་སྭཱ་ཧཱ། ཨོྃ་བཻ་ཤྲ་བ་ཎ་ནཻ་བི་དྱེ་ཧཱུྃ་སྭཱ་ཧཱ།
en: “Oṃ vaiśravaṇa puṣpe hūṃ svāhā Oṃ vaiśravaṇa dhupe hūṃ svāhā Oṃ vaiśravaṇa dīpaṃ hūṃ svāhā Oṃ vaiśravaṇa gandhe hūṃ svāhā Oṃ vaiśravaṇa naivedye hūṃ svāhā

source: གཙོ་བོ་མཆོད་ཅིང་འཁོར་ཀྱང་མཆོད། །དེ་ནས་རིམ་པས་མཆོད་པ་ནི།
en: “Worship the central deity and also his retinue; Make offerings in sequence.

source: །གསང་སྔགས་ཀུན་ཏུ་སྤེལ་ཏེ་བཟླས། །སྤྲོ་དང་བསྡུ་བ་ཀུན་དུ་བྱ།
en: Recite, spreading secret mantras; Perform the projection and reabsorption.

source: །སྤེལ་བྱེད་ཀུན་གྱི་ཐུན་མོང་ཡིན།
en: This is the ordinary form of propagation.

source: །ཨོྃ་བཻ་ཤྲ་ཝ་ཎཱ་ཡ་ཆེ་གེ་མོ་མཱ་ར་ཡ་ཕཊ་སྭཱ་ཧཱ།
en: “Oṃ vaiśravaṇaya chegemo māraya phaṭ svāhā

source: གཙོ་བོ་ཇི་ལྟར་འཁོར་ཀྱང་དེ། །རང་གི་རིག་པས་མཆོད་པར་བྱ།
en: “For the retinue, just as for the main deity, Worship them with their own incantations.

source: །རིག་པ་ཀུན་ཏུ་བརྟན་བྱས་ནས། །རྡུལ་ཕྲན་བཞིན་དུ་བརླག་པར་བསམ།
en: Fully supported by incantations, Imagine that they crush them into dust.

source: །ཕྲིན་ལས་བཅོལ་ལ་གཏོར་མ་བཏང་།
en: “Enjoin them to perform activity and give an oblation.

source: །གཏོར་དང་གཏོར་མའི་རིམ་པ་ནི། །གོ་རིམས་བཞིན་དུ་དབུལ་བར་བྱ།
en: As for the stages of sprinkling and offering the oblation, Offer them in order.

source: །ཞི་བའི་ལས་ཀྱི་རིམ་པ་ནི།
en: The sequence for the peaceful activity is as follows:

source: །ཐབ་ཁུང་མཐོ་གང་ཚད་ཉིད་ལ། །བསྲེག་རྫས་ལ་སོགས་རབ་ཏུ་དབུལ།
en: “On a hearth of sufficient size, Offer the burning substances and so forth.

source: །ལུས་ངག་ཡིད་གསུམ་སྡིག་བཅོམ་ནས། །ཡེ་ཤེས་མེ་ཡི་ངོ་བོར་བྱ།
en: Having conquered the evil deeds of body, speech, and mind, Transform them into the essence of wisdom fire.

source: །སྣོད་དང་ཐབ་ནི་དོར་བར་བྱ།
en: “Discard the vessel and the hearth.

source: །དེར་ནི་གདོན་རྣམས་ཀུན་སྲེག་ཅིང་། །བགེགས་ཆེན་ཞི་བའི་ཡས་ཀྱང་བྱ།
en: Completely burn all grahas there, And also make a ransom rite to pacify the great obstructors.

source: །རྒྱས་དང་དབང་དུ་བྱ་བ་ལ། །ལས་དང་བྱེ་བྲག་རིམ་པ་རྣམས།
en: In order to increase and magnetize For the activity and specific stages,

source: །སྔར་བཤད་པ་ཡི་ལས་བཞིན་དུ། །ཐབ་དབྱིབས་བྱེ་བྲག་ཤེས་པར་བྱ།
en: Know that the details of the shape of the hearth Are in accordance with the previously explained activities.

source: །སེར་དང་དམར་བའི་བུད་ཤིང་སོགས། །རིམ་པ་རྫས་ལྡན་དབུལ་བ་ནི།
en: “As for the substantial offering, With the stages of red and yellow firewood and so forth:

source: །ཨོྃ་བཻ་ཤྲ་བ་ཎཱ་ཡ་དྷ་ནྃ་པུཥྚིྃ་ཀུ་རུ་ཡེ་སྭཱ་ཧཱ། ཨོྃ་བཻ་ཤྲ་བ་ཎ་བ་ཤྃ་ཀུ་རུ་སྭཱ་ཧཱ། ཨོྃ་བཻ་ཤྲ་བ་ཎཱ་ཡེ་ཤཱིནྟ་ཀུཾ་རུ་སྭཱ་ཧཱ།
en: “Oṃ vaiśravaṇāya dhanapuṣṭiṃ kuru ye svāhā Oṃ vaiśravaṇa vaśaṃ kuru svāhā Oṃ vaiśravaṇāye śāntiṃ kuru svāhā

source: གཙོ་བོ་ཇི་བཞིན་འཁོར་བཅས་ནི། །རིག་པའི་རྫས་ཀྱིས་མཆོད་པར་བྱ།
en: “Just as for the main deity, for the retinue also Make offerings with the incantatory substances.

source: །བསྲེག་པའི་རྫས་ནི་བག་ཟན་དང་། །ཡུངས་ཀར་མངར་སོགས་རིམ་པས་མཆོད།
en: Offer the burned substances of dough, Mustard seeds, sweets, and so forth in sequence.

source: །ཕྲིན་ལས་རྣམ་བཞི་ཀུན་འགྲུབ་སྟེ། ། བརྩེ་བར་བརྩོན་པས་ཉེ་བར་འགྲུབ།
en: “The four activities are perfectly accomplished. With superior diligence, they are fully accomplished.

source: །འབྲིང་དང་ཐ་མས་འབྲིང་དང་ནི། །ཐ་མ་ཉིད་དུ་ཤེས་པར་གྱིས།
en: With middling and lesser diligence, know that They are accomplished in a middling and lesser way.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་རྣམ་ཐོས་ཀྱི་བུ་འཁོར་དང་བཅས་པ་རྣམས་ཀྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then Vaiśravaṇa and his retinue declared to the Blessed One,

source: །བཅོམ་ལྡན་འདས་བདག་ཅག་རྣམས་ཀྱིས་བཤད་པའི་ལས་འདི་རྣམས་སྒྲུབ་པ་པོ་དེས་དུས་རྒྱུན་དུ་བཅོམ་ལྡན་འདས་ཕྱག་ན་རྡོ་རྗེ་དང་། གནོད་སྦྱིན་རྣམས་ལ་དཀར་གསུམ་གྱིས་མཆོད་པར་བྱའོ།
en: “Blessed One, whoever engages in the practices that we have explained here should continually worship the Blessed Vajrapāṇi and the yakṣas with the three white substances.

source: །ཆང་ཀུན་ཏུ་སྤང་བར་བགྱིའོ། །ཤ་རྣམས་ནི་འོས་པ་དང་ཤིས་པ་དྲང་བར་བྱའོ།
en: He must completely avoid alcohol. He must acquire meats that are suitable and auspicious.

source: །དེ་ལྟར་རྩེ་གཅིག་གིས་བདག་ཅག་སྒྲུབ་པ་དེ་རྣམས་ཀྱི་ཕྲིན་ལས་ཇི་ལྟ་བ་བཞིན་དུ་བདག་ཅག་གིས་མ་བསྒྲུབས་ན་
en: If we fail to accomplish, properly and one-pointedly, the activities that are our accomplishments,

source: བདག་ཅག་གིས་བཅོམ་ལྡན་འདས་ལ་འཁུས་པར་གྱུར་ཅིང་། བདག་ཅག་གིས་ཆོས་མ་བསྐྱངས་པར་བྱས་པ་ཡིན་ནོ།
en: then we will have insulted the Blessed One and we will have failed to protect the Dharma.

source: །དེ་ལ་བདག་གི་བྲོ་ཚིག་ནི་འདི་ཡིན་ནོ། །ཨོྃ་བཻ་ཤྲ་བ་ཎ་ཨར་ཐ་ཁ་ཐམ་ཞེས་པའོ།
en: This is our oath. Oṃ vaiśravaṇa arthakathama. ”

source: རྣམ་ཐོས་ཀྱི་བུ་ཆེན་པོ་ལེགས་སོ། །ཤིན་ཏུ་རབ་ཏུ་ལེགས་སོ།
en: “Great Vaiśravaṇa, that is excellent. So very excellent!”

source: །མ་འོངས་པའི་གང་ཟག་གི་དོན་དུ་རང་གི་གསང་བ་སྨྲས་པ་ནི་དོན་ཆེན་པོ་དང་ལྡན་ནོ།
en: “So very excellent! The secret of which you have spoken will be of great benefit for the people of the future.

source: །ངས་ཀྱང་དེ་རྣམས་ཀྱི་དོན་ངེས་པར་འགྲུབ་པར་བྱ་བའི་ཕྱིར་སྔགས་འདི་བཤད་ཀྱིས་ཉོན་ཅིག
en: In order that their benefit will certainly be accomplished, I also will pronounce this mantra. Listen!”

source: །བཅོམ་ལྡན་འདས་ལ་ལེགས་སོ་ཞེས་རྣམ་ཐོས་ཀྱི་བུ་ལ་སོགས་པ་རྣམས་ལྟར་ཉན་ནོ།
en: “Excellent!” said Vaiśravaṇa and the others to the Blessed One, and listened accordingly.

source: ཨོཾ་བཛྲ་པཱ་ཎི་ནཱི་ལཱྃ་བ་རདྷ་ར་བཛྲ་སྥོ་ཊ་ཧཱུྃ་ཕཊ་སྭཱ་ཧཱ། རིག་པ་འདི་ནི་ལས་ཐམས་ཅད་དབང་དུ་སྡུད་པའི་སྔགས་སོ།
en: “Oṃ vajrapāṇi nīlāmbara­dhara vajrasphoṭa hūṃ phaṭ svāhā. This incantation is a mantra that brings control over activities.

source: །རྣམ་ཐོས་ཀྱི་བུ་ཆེན་པོས་ཇི་ལྟར་ཁས་བླངས་པ་ལྟར་གསང་བ་དང་ལྡན་པར་བྱེད་པའོ།
en: Great Vaiśravaṇa brings about possession of the secret just as he promised.”

source: །དེ་བཞིན་གྱུར་ཞེས་སྨྲས་ནས་གནོད་སྦྱིན་མི་སྣང་བར་གྱུར་ཏོ།
en: “That is so,” said the yakṣas, and vanished.

source: །རྡོ་རྗེས་འོག་གི་རྒྱུད་ལས་རྣམ་ཐོས་སྲས་ཀྱི་ལེའུ་སྟེ་གསུམ་པའོ།།
en: This was the third chapter of The Tantra of the Vajra in the Underworld, the chapter on Vaiśravaṇa.

source: །བཅོམ་ལྡན་འདས་མ་འོངས་པའི་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་གདུག་པ་ཅན་ལ་བསྣུན་པའི་འཁོར་ལོ་བཤད་དུ་གསོལ་ཞེས་
en: “Lord, for the sake of sentient beings of the future, please teach a wheel that strikes all wicked ones!”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཅང་མི་གསུང་བར་ཐུགས་ཀྱིས་གནང་
en: The Blessed One mentally consented to this request, yet remained completely silent.

source: ནས་རང་གི་ཐུགས་ཀ་ནས་འོད་ཟེར་ཀུན་ཏུ་ཁྱབ་པར་སྤྲོས་ཏེ། སེམས་ཅན་ཐམས་ཅད་འཁྱམས་པས་ཁྱབ་པར་མཛད་
en: Instead he projected an all-pervading light from his heart center that embraced all sentient beings with love.

source: ལག་ན་རྡོ་རྗེ་ངས་ས་འོག་གི་བགེགས་ལ་བསྣུན་པའི་འཁོར་ལོ་བཤད་ཀྱིས་ཁྱོད་རྩེ་གཅིག་ཏུ་ཉོན་ཅིག་དེ་ལྟར་འཚལ་ལོ་ཞེས་
en: “Vajrapāṇi, I shall now teach a wheel that strikes the obstructors within the ground below. So listen one-pointedly, and I will teach.”

source: གང་ཞིག་འཁྲུལ་འཁོར་བྱེད་འདོད་པས། །ཉམས་དགའ་དབེན་པའི་གནས་དག་ཏུ། །ཕྱག་ན་རྡོ་རྗེའི་རྣལ་འབྱོར་བྱ།
en: “Whoever wishes to construct such a diagram Should go to pleasant and solitary places And perform the practice of Vajrapāṇi.

source: །སྣོད་བཅུད་རྡོ་རྗེ་གཏུམ་པོར་བསྒོམ།
en: Visualize the world and its contents as Vajracaṇḍa.

source: །རླུང་ནས་རི་རབ་མཐར་ཐུག་པ། །རྡུལ་སྙེད་གྲངས་ཀྱི་སྐུ་རུ་བསམ།
en: “From the element of wind up until the central mountain, Imagine it to consist of enlightened bodies as numerous as there are particles.

source: །དབུས་ན་ཕྱག་རྡོར་རྣལ་འབྱོར་བསྒོམ། །རི་བོང་འཛིན་པ་ཞབས་ཀྱིས་བརྡེབས།
en: Amid this, cultivate the practice of Vajrapāṇi. His feet are placed on the holder of the hare.

source: །སྟོང་གསུམ་ཚད་ཀྱི་ཟླ་བ་ལ། །བགེགས་ཆེན་ཀུན་ཏུ་འདར་བར་བསྒོམ།
en: “On this moon, the size of the trichiliocosm, Visualize the great obstructor, utterly shaking.

source: །སྐུ་ལ་ཉི་མ་སྟོང་ལྡན་པའི། །གཟི་བརྗིད་བཟོད་དཀའི་འོད་ཟེར་གྱིས། །བགེགས་རྣམས་མ་ལུས་འཚིག་པར་བསྒོམ།
en: Vajrapāṇi’s body shines with the splendor of a thousand suns. “Visualize that this light, which is unbearable to watch, Burns away all obstructors without exception.

source: །ལྗགས་ལས་བཟླས་པའི་སྔགས་ཕྲེང་གིས། །སྟོང་གསུམ་གང་བར་རབ་ཏུ་བསྒོམ།
en: The mantra chain recited from the tongue Is seen to fill the trichiliocosm.

source: །རྒྱན་དུ་བྱས་པའི་ཀླུ་བརྒྱད་ཀྱིས། །ཁ་རླངས་ཆེན་པོ་བཏང་བ་ལས། །ལྷ་ཀླུ་ཐམས་ཅད་སྐྲག་པར་འགྱུར།
en: “The eight adorning nāgas Release a giant breath of steam That terrifies all gods and nāgas.

source: །ཐུགས་ལས་ཁྲོ་སྤྲོས་དེ་དག་གིས། །བསྐལ་པའི་རླུབ་ལྟར་འཐོར་བར་འགྱུར།
en: Wrathful ones are projected from his heart center And, like the winds at the end of an eon, cause them to disperse.

source: །ཕྱག་གིས་རྡོ་རྗེ་རབ་བསྣུན་པས། སྒྱོགས་གཟེར་བཞིན་དུ་བསྣུན་པར་འགྱུར།
en: “With his hand, he strikes with the vajra; Like a bolt shot from a crossbow, it strikes down.

source: །ཧཱུྃ་ཧཱུྃ་འབྲུག་ལྟར་རབ་ཏུ་སྒྲོགས། །སྐད་ཀྱིས་ཀུན་ཏུ་བཀུག་པར་བསམ།
en: Hūṃ hūṃ resounds like thunder; They are thoroughly suppressed by his voice.

source: །དེ་ལྟར་བྱས་འགྱུར་ཐམས་ཅད་འགྲུབ། །ལས་ཀྱིས་མནར་བ་འཇིག་པར་འགྱུར།
en: “Act like that, and all will be accomplished; Karmic torment will come to an end.

source: །ཕྱག་ན་རྡོ་རྗེ་མི་ཤེས་པར། །གང་ཞིག་གཞན་བསྒྲུབ་སྐལ་དམན་པར།
en: If one does not know Vajrapāṇi, Other accomplishments will be inferior.

source: །འདི་ལ་གང་འགྲུབ་ཐམས་ཅད་འགྲུབ། །མཆོག་དང་ཐུན་མོང་བྱེ་བྲག་གོ།
en: “Whatever is accomplished hereby accomplishes all— In particular, the supreme and the common.”

source: །རྡོ་རྗེས་འོག་གི་རྒྱུད་ལས་བསྣུན་པའི་འཁོར་ལོ་སྟེ་ལེའུ་བཞི་པའོ།།
en: This was the fourth chapter on the wheel of suppression from The Tantra of the Vajra in the Underworld.

source: །།དེ་ནས་གཞན་ཡང་འཁྲུལ་འཁོར་གྱི། །ཆོ་ག་རྡོ་རྗེ་འཛིན་པས་གསུངས།
en: Then, at another time, the Vajra Holder Taught the ritual of the diagram:

source: །གྲོ་གའམ་ཤིང་ཤུན་དག་ལ་ནི། །རེའུ་མིག་ཉི་ཤུ་རྩ་གཅིག་པའི། །འཁོར་ལོ་དག་ནི་རབ་བྲིས་ཏེ།
en: “On a piece of birch bark or rind, Draw a wheel With twenty-one sections.

source: །ཟླ་བ་ཡར་གྱི་ངོ་ལ་བརྩམ། །རྩེ་གཅིག་སེམས་ཀྱིས་རབ་ཏུ་བྲི།
en: Commence this on the waxing phase of the moon, “And write, with a one-pointed mind.

source: །དབུས་སུ་དྲག་པོའི་ཡི་གེ་དགོད། །གཉིས་པར་ནོར་འཛིན་ཡི་གེ་སྟེ། །གསུམ་པ་བཛྲ་ཞེས་པ་དང་། །བཞི་པར་ཆུ་ཡིག་དང་པོ་དགོད། །ལྔ་པར་ཎི་ནི་རབ་ཏུ་དགོད། །མཚམས་བཞིར་བསྒྲུབ་བྱའི་གསོད་སྙིང་བྲི། །དེ་ནི་ནང་གི་རེའུ་མིག་གོ།
en: In the center, place the wrathful syllable. In the second, the syllable of the wealth holder. In the third, comes the vajra. “In the fourth, place the first syllable of water. In the fifth, place the ṇi. At the four borders, write the essence mantra for killing the target. These are the inner sections.

source: །ཕྱི་ཡི་རེའུ་མིག་བཅུ་གཉིས་ལ། །ཨོཾ་སྤངས་ཡི་གེ་བཅུ་གཉིས་ལ། །དེ་ཡི་གསང་སྔགས་འདི་ཡིན་ཏེ། །ནཱི་ལཱྃ་བ་ར་དྷ་ར་བཛྲ་པཱ་ཎི་ཧཱུྃ་ཕཊ་ཞེས་བྱའོ།
en: “On the twelve outer sections Are the twelve syllables, omitting oṃ. On these the secret mantra is as follows: Nīlāmbara­dhara­vajra­pāṇi hūṃ phaṭ.

source: །རབ་ཏུ་རྫོགས་པའི་འཁོར་ལོ་སྟེ། །བསྒྲུབ་བྱའི་སྙིང་གར་དྲིལ་དེ་གཞུག །དང་པོའི་མཐའ་ནས་དྲིལ་བར་བྱ།
en: “This completed wheel Should be rolled up and fixed to the heart center of the target; It should be rolled up from the front edge.

source: །དེ་ནས་སྦྱིན་སྲེག་ཆོ་ག་བྱ།
en: Then the fire-offering ritual should be performed.

source: །གལ་ཏེ་མནན་པ་བྱེད་འདོད་པས། །སྔར་བཞིན་འཁྲུལ་འཁོར་རྫོགས་བྱས་ནས། །མཐའ་རུ་མནན་པའི་ཆོ་ག་བྱ།
en: “If one wishes to subdue, The diagram should be completed as before. At the end, perform the ritual of subjugation.

source: །ཁམ་ཕོར་གསར་པ་ཁ་སྦྱར་དུ། །བཅུག་ནས་རྡོ་རྗེ་རྒྱ་གྲམ་བྲི།
en: Place the diagram in a fresh clay cup And draw a crossed vajra on the lid.

source: །རྡོ་ཡི་སྦྱིན་གྱིས་རབ་སྦྱར་ནས། །གཙུག་ལག་ཁང་སོགས་མནན་པར་བྱ།
en: Closing it with clay, Temples and the like can be suppressed.

source: །གལ་ཏེ་རེའུ་མིག་མི་འདོད་ན། །རྩིབས་བཅུ་གཉིས་པའི་འཁོར་ལོ་བྱ།
en: “If you prefer not to have sections, Make a wheel with twelve spokes.

source: །ལྟེ་བར་ཧཱུྃ་དང་བསྒྲུབ་བྱའི་མིང་། །སྤེལ་ལ་རབ་དུ་དགོད་པར་བྱ། །ལྷག་མ་བཅུ་གཉིས་རྩིབས་ལ་དགོད།
en: In the center, place and affix A hūṃ and the name of the target. “The remaining twelve are placed on the spokes.

source: ། བྲི་བ་རྫོགས་ན་སྙིང་གར་གཞུག །དགུག་དང་གཞུ་གསོགས་བྱས་ལ་བསྲེག
en: When the drawing is complete, insert it in the heart center. Summon, usher, and so forth, then burn.

source: །མི་འདོད་མནན་པའི་ཆོ་ག་བྱ། །མར་གྱི་དུས་ལ་ཤིས་པ་ཡིན།
en: “Perform the ritual for suppression of the unwanted; From that time onward, there is auspiciousness.

source: །འཁྲུལ་འཁོར་ཇི་ལྟར་བྲིས་པ་ལྟར། །གང་འདོད་ལས་ལ་ཐེ་ཚོམ་མེད།
en: Whenever the diagram is drawn, There is no doubt that things will occur as desired.

source: །དཔེར་ན་མེ་ལྕེས་རྩྭ་བསྲེགས་འདྲ། །གང་ཡིན་གནས་པར་མི་འགྱུར་རོ།
en: “Just like dry grass being burnt up by flames, The person will be unable to remain.”

source: །དཔལ་རྡོ་རྗེས་འོག་གི་རྒྱུད་ལས་བྲི་བའི་འཁྲུལ་འཁོར་གྱི་ཆོ་ག་སྟེ་ལེའུ་ལྔ་པའོ།།
en: This was the fifth chapter on the ritual for drawing the diagram from The Glorious Tantra of the Vajra in the Underworld.

source: །བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཟབ་མོའི་སྤྱོད་ཡུལ་ལགས་པས་སྦྱིན་སྲེག་ལ་སོགས་པས་གྲོལ་བར་ཅང་འགྱུར་ལགས་སམ།
en: “Lord, since everything is the domain of the profound, does one get liberated through such rituals as fire offerings, or not?

source: བདག་གི་ཐེ་ཚོམ་བསལ་དུ་གསོལ་ཞེས་ཞུས་སོ།
en: Please clear away my doubts!”

source: ལག་ན་རྡོ་རྗེ་སྙིང་རྗེ་ཆེ། །དད་པའི་ཤུགས་ཀྱིས་རབ་ཉམས་ཏེ། །དཀྱིལ་འཁོར་རྫས་ཀྱི་སྦྱོར་ལྡན་ཞིང་། །སྦྱིན་སྲེག་ལས་དང་དེ་ཉིད་ཤེས།
en: “Vajrapāṇi! Great compassion, Removal through the power of faith, The maṇḍala endowed with substantial riches, And the activity of the fire offering—these you should know.

source: །སྡོམ་པར་དམ་ཚིག་རྒྱུད་ལྡན་ན། །མཚན་མས་གྲོལ་བར་འགྱུར་བ་སྟེ།
en: “If your stream of being keeps samaya vows as your pledge, You will be liberated through attributes.

source: །དཀྱིལ་འཁོར་སྦྱིན་སྲེག་རྫས་ལ་སོགས། །མེད་ན་དངོས་གྲུབ་མི་འགྲུབ་པས། །སྦྱིན་སྲེག་ལས་ནི་འབད་པས་བརྩམ།
en: Without a maṇḍala, fire offering, substances, and so forth, Spiritual accomplishments will not be achieved. “Therefore be diligent in the activity of fire offering.

source: །ཕྲིན་ལས་བཞི་ཡི་སྦྱིན་སྲེག་ལས། དྲག་པོའི་རིམ་པ་བྱ་བ་ནི།
en: Among the fire offerings of the four enlightened activities, The stages of the wrathful one is as follows:

source: །ཁྲུ་བཞི་པ་ཡི་དཀྱིལ་འཁོར་ལ། །དབུས་སུ་ཟུར་གསུམ་ཁྲུ་རེ་ཚད། །ཟབས་སུ་ཁྲུ་ཕྱེད་བརྐོ་བར་བྱ།
en: In the center of a maṇḍala of four cubits, “There is a triangle of one cubit; It should be dug to a depth of half a cubit.

source: །ཕྱི་རོལ་རིམ་པ་གསུམ་ལྡན་པ། །དབུས་སུ་རྡོ་རྗེའི་མཚན་མ་བྲི།
en: Outside there are three levels; Draw the features of a vajra in the middle.

source: །རིམ་པ་གསུམ་ལ་རྡོ་རྗེ་ཡི། །རྩེ་གསུམ་ཕྲེང་གིས་བསྐོར་བ་བྲི། །མཚམས་སུ་ལྕགས་ཀྱུ་བྲི་བར་བྱ།
en: “At the three levels, draw the three points of a vajra Encircled by a chain. In the intermediate spaces, draw iron hooks.

source: །ཚེར་མ་ཅན་གྱི་ཤིང་བུ་ནི། །ཁྲུ་གང་ཚད་ཀྱིས་རབ་ཏུ་ཤིས།
en: A piece of thorny wood “The size of a cubit is very auspicious.

source: །དུག་དང་ཁྲག་དང་སྐེ་ཚེ་སོགས། །རྫས་ནི་རིམ་པར་ཤེས་པར་བྱ།
en: Substances such as poison, blood, and black mustard seeds Should be gradually known.

source: །བདག་ཉིད་ལྷ་ཡི་རྣལ་འབྱོར་གྱིས། །ཡེ་ཤེས་ཁྲོ་བོ་སྤྱན་དྲངས་ཏེ། །འཇིག་རྟེན་གསུམ་འདུལ་གཟུགས་སུ་བསམ།
en: Oneself, through the yoga of the deity, “Invites the wrathful wisdom, Visualized in the form that tames the three worlds.

source: །མཆོད་པའི་རིམ་པ་རབ་ཏུ་དབུལ། །དེ་ལ་སྦྱིན་སྲེག་གི་སྔགས་གསུངས་པ་འདི་ཡིན་ཏེ། ཨོཾ་ནཱི་ལཱྃ་བར་དྷ་ར། ཨོཾ་བཛྲ་ཛྭ་ལ་ཨ་ན་ལ་ཧ་ན་སརྦཱ་དུཥྚ་སརྦྦ་བྷི་རྨྨྃ་ཀུ་རུ་ནཱི་ལཱྃ་བར་དྷ་ར་བཛྲ་པཱ་ཎི་ཆེ་གེ་མོ་མཱ་ར་ཡ་ཧཱུྃ་ཕཊ་ཅེས་པས་རྫས་རྣམས་བསྲེག་གོ།
en: Perform the stages of worship. For that, the mantra of the fire offering to be uttered is this: “Oṃ nīlāmbara­dhara oṃ vajra­jvalānala hana sarva­duḥkha sarva­vighna samma kuru­nīlāmbara­dhara vajra­pāṇi chegemo māraya hūṃ phaṭ. “Say this while burning the substances.

source: །དུག་ཁྲག་སྐེ་ཚེ་ལན་ཚྭ་ལས། །གཟུགས་བྱས་རབ་ཏུ་བསྒྲུབས་ཏེ་བསྲེག
en: “From poison, blood, black mustard, and salt, Create the form, accomplish it, and burn it.

source: །ཨོཾ་ནཱི་ལཱྃ་བ་ར་དྷ་ར་བཛྲ་པཱ་ཎི་ཡཀྵ་ཁཱ་ད་ཡ་ཁཱ་ད་ཡ་བན་དྷ་ཡ་བན་དྷ་ཡ་མོ་ཧ་ཡ་མོ་ཧ་ཡ་ཤ་ཏྲཱུཾ་ཨཱ་ན་ཡ་ཧཱུྃ་ཕཊ། གཟུགས་ལ་བྲབ་པའི་སྔགས་སོ།
en: “Oṃ nīlāmbara­dhara vajrapāṇi yakṣa khādaya khādaya bandhaya bandhaya mohaya mohaya sha hum ānaya hūṃ phaṭ. “This was the mantra for scattering the form.

source: །ཨོཾ་ནཱི་ལཱཾ་བ་ར་དྷ་ར་བཛྲ་པཱ་ཎི་ཤ་ཏྲཱུཾ་གྲྀ་ཧྞ་ཨཱ་ཀཪྵ་ཡ་ཧཱུཾ་ཛཿཛཿ། འགྲོ་བ་དགུག་པའི་སྔགས་སོ།
en: “Oṃ nīlāmbara­dhara vajrapāṇi sha hum gṛham ākarṣaya hūṃ jaḥ jaḥ. “This was the mantra for summoning beings.

source: །དེ་ལྟར་སྦྱིན་སྲེག་རབ་བྱས་ནས། །ཆུ་བོ་སྐམས་དང་ཀླུ་ཤིང་གཅད། །གླང་ཆེན་གཡང་ལྟུང་མེ་ཆེན་འབར།
en: “Having performed the fire offering in that manner, Go to a dried-up river, fell a nāga tree, And make a large fire with elephant dung.

source: །ནད་དང་ཡམས་སོགས་བྱུང་བའི་ཚེ། །ཞི་བ་མཆོག་གི་ལས་བསྒྲུབས་ཏེ།
en: Should illness and disease occur, “Perform the activity of supreme pacification.

source: །ཐབ་ཁུང་ཟླུམ་པོ་རབ་དཀར་བ། །རིམ་པ་གསུམ་ལྡན་ཁྲུ་གང་ཚད། །ཟབས་སུ་ཁྲུ་ཕྱེད་བརྐོས་བྱས་ནས།
en: Dig a suitable spherical fire pit in three levels; It should be one cubit wide And half a cubit deep.

source: ། ཞི་བའི་ལས་ཀྱི་ཆོ་ག་བྱ། །དེ་ལྟར་བྱས་ན་མཚན་མ་ཡི། །དངོས་གྲུབ་ཐོབ་པར་ཐེ་ཚོམ་མེད།
en: “Then perform the ritual of peaceful activity. If done in this manner, there is no doubt that one obtains Spiritual accomplishments with the marks of success.

source: །ལག་ན་རྡོ་རྗེ་རྡོ་རྗེ་འཛིན། །གུས་པས་རྒྱུད་དོན་རབ་ཏུ་ཟུང་། །འགྲོ་བའི་དོན་ལ་རབ་བརྩོན་གྱིས།
en: Vajrapāṇi, Vajra Holder! “With devotion, keep the meaning of the tantra, And be diligent for the sake of living beings!

source: །ཀྱེ་མ་རྒྱུད་ཆེན་མཆོག་ཏུ་གསང་། །བྱིན་རླབས་སྔོན་དུ་ཆེར་འབྱུང་བ།
en: “O! This most secret great tantra Grants great blessings from the start.

source: །སྟོན་པ་རྡོ་རྗེ་འཆང་གིས་གསུངས། །རབ་ཏུ་འབད་པས་བསྒྲུབ་པར་གྱིས།
en: It was spoken by the teacher Vajradhara. Be diligent in its practice.”

source: །དཔལ་རྡོ་རྗེས་འོག་གི་རྒྱུད་ལས་སྦྱིན་སྲེག་གི་རིམ་པ་སྟེ་ལེའུ་དྲུག་པའོ།།
en: This was the sixth chapter on the stages of fire offering from The Glorious Tantra of the Vajra in the Underworld.

source: །།དེ་ནས་སྟོན་པ་རྡོ་རྗེ་འཆང་། །དཔལ་ཆེན་གདན་ལ་རབ་བཞེངས་ནས།
en: Then the teacher, the Vajra Holder, The Great Glorious One, stood up on his seat.

source: །ལག་ན་རྡོ་རྗེ་ལ་གཟིགས་ནས། ། ལས་ཀྱི་ཆོ་ག་བཤད་པར་བྱ།
en: He gazed at Vajrapāṇi and said: “One should know the ritual of activity.

source: །དུག་ལ་སོགས་པའི་རྫས་རྣམས་ལ། །གང་འདོད་པ་ཡི་གཟུགས་བྱས་ཏེ། །སྙིང་གར་འཁྲུལ་འཁོར་རབ་ཏུ་གཞུག
en: With substances such as poison, Produce the form that you wish for, Then insert the diagram at the heart center.

source: །བདག་ཉིད་ལས་ཀྱི་ལྷར་གསལ་བས། །ག་འུ་ནང་དུ་རབ་བཅུག་སྟེ།
en: “Visualize yourself as the deity of activity, And place it in a box.

source: །ཚོན་གྱི་ཐ་གུ་སྣ་ལྔ་དཀྲི། །སྙིང་གའི་ལྕགས་ཀྱུས་རབ་བཀུག་ནས།
en: Tie it with five strings of various colors, Then summon your target with the hook at the heart center.

source: །ཡི་གེ་བཅུ་གསུམ་འཁྲུལ་འཁོར་བཟླས། །འགུལ་གཡོ་ཡི་ནི་རྟགས་བྱུང་ནས། །ཆུ་ཆེན་གཞུང་ལ་གཏང་བར་བྱ།
en: “Next recite the thirteen letters of the diagram. When the signs of shivering and trembling occur, Throw it in the middle of a river.

source: །གལ་ཏེ་རྟགས་དེ་མ་བྱུང་ན། །དྷ་རུ་ར་ཡི་ཁུ་བ་དང་། །ཁྲག་དང་དུག་བསྲེས་རབ་བྱུགས་ཏེ།
en: If the signs should not occur, “Mix the fluid of datura, With blood and poison, and apply it.

source: །ཚེར་མ་ཅན་གྱི་ཤིང་མེས་བསྲེག ། ཨོཾ་ནཱི་ལཱཾ་བ་ར་དྷ་ར་བཛྲ་པཱ་ཎི་སྟམ་བྷ་ཡ་མོ་ཧ་ཡ་བན་དྷ་ཡ་ད་ཧ་ན་ཡ་ཧཱུྃ་ཧཱུྃ་ཕཊ།
en: Then burn it in the fire of a thorny tree. “Oṃ nīlāmbara­dhara vajrapāṇi stambhaya mohaya bandhaya dāhanaya hūṃ hūṃ phaṭ.

source: དུས་གསུམ་དག་དུ་བདུགས་བྱས་ནས། །སྐད་ངན་སྣ་ཚོགས་གདོན་པར་བྱེད།
en: “Fumigate it at the three times, And utter many negative words.

source: །དེ་ནས་སྔགས་འདིས་ཆུ་ལ་དོར། །ཨོཾ་ཙཎྜ་མ་ཧཱ་རོ་ཥ་ཎ་ཧཱུྃ་ཕཊ།
en: Then throw it in the water, using this mantra: “Oṃ caṇḍa­mahā­roṣaṇa hūṃ phaṭ.

source: །ཚོན་གྱིས་དྲིལ་ནས་རབ་ཏུ་བོར། །བསམ་པས་བ་ཚྭའི་རྒྱ་མཚོར་སྐྱུར།
en: “Roll it around in pigment and throw it away; Imagine that you throw it into a salty ocean.

source: །དེ་ནས་མི་ལྡོག་བྱ་བའི་ཕྱིར། །སྔགས་འདི་རྒྱུན་དུ་བཟླ་བར་བྱ། །ཨོཾ་ནཱི་ལཱྃ་བ་ར་དྷ་ར་བཛྲ་པཱ་ཎི་ཧཱུྃ་ཧཱུྃ་སྟམ་བྷ་ཡ་ནན་ཕཊ་ཅེས་རྒྱུན་དུ་བཟླ་བར་བྱའོ།
en: Then, for the sake of irreversibility, Recite this mantra continuously: “Oṃ nīlāmbara­dhara vajrapāṇi hūṃ hūṃ stambhaya nan phaṭ. “Recite this continuously.

source: །དེ་ནས་ལས་དེ་ངེས་པར་འགྲུབ་བོ།
en: Then the activity will certainly be accomplished.”

source: །རྡོ་རྗེས་འོག་གི་རྒྱུད་ལས་བསྐྲད་པའི་འཁོར་ལོའི་ལེའུ་སྟེ་བདུན་པའོ།།
en: This was the seventh chapter on the wheel of expulsion from The Tantra of the Vajra in the Underworld.

source: །།དེ་ནས་བཅོམ་ལྡན་འདས་རྡོ་རྗེ་འཛིན་པས་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་སྔགས་ཀྱི་ལེའུ་འདི་གསུངས་སོ།
en: Then the Blessed One, the Vajra Holder, taught this chapter on mantra for the sake of living beings:

source: །ཨོཾ་ནཱི་ལཱཾ་བ་ར་དྷ་ར་བཛྲ་པཱ་ཎི་ཧཱུྃ་ཧཱུྃ་ཕཊ། བཅོམ་ལྡན་འདས་ཀྱི་རྩ་བའི་སྔགས་ལས་ཐམས་ཅད་སྒྲུབ་པའོ། །འདི་ནི་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཐུགས་ཀྱི་གསང་བའོ།
en: “Oṃ nīlāmbara­dhara vajrapāṇi hūṃ hūṃ phaṭ. “The root mantra of the Blessed One accomplishes all activities; This is the secret of the awakened mind of all buddhas.

source: །འདིས་ནི་མ་བསྒྲུབས་པར་ཡང་ལས་ཐམས་ཅད་འགྲུབ་སྟེ།
en: It accomplishes all activity, even without practice;

source: ཕྱག་རྒྱ་ཐམས་ཅད་འཆིང་བསྒྲུབ་པ་ལ་ནི་རྡོ་རྗེ་ཁུ་ཚུར་གྱིས་སོ།
en: With the vajra fists, you accomplish the binding of all mudrās.

source: །དམ་ཚིག་ཐམས་ཅད་སྒྲུབ་པ་ལ་ནི་རྡོ་རྗེ་རབ་ཏུ་གདེངས་པས་སོ།
en: “With vajra confidence, you accomplish all samaya vows!

source: །སེམས་ཅན་ཐམས་ཅད་རྗེས་སུ་ཆགས་པར་བྱ་བ་ལ་ནི་རྡོ་རྗེ་བཞད་པས་སོ།
en: With the vajra smile, you are affectionate toward all sentient beings.

source: །ཐམས་ཅད་ལྐུགས་པར་བྱ་བ་ལ་ནི་རྡོ་རྗེ་ཧཱུྃ་སྒྲས་སོ།
en: By uttering the vajra hūṃ, you make everyone mute.

source: །ནམ་མཁའ་ལ་འཕྲོ་བའི་དངོས་གྲུབ་ལ་ནི་རྡོ་རྗེ་ཀུ་མུ་དས་བྱའོ།
en: Through the vajra lotus, you gain the spiritual accomplishment of traversing the sky.

source: །ཀླུ་ཐམས་ཅད་འདུལ་བ་ལ་ནི་རྨ་བྱའི་མཇུག་སྒྲོས་བྱའོ།
en: “With the tail of the peacock, you tame all nāgas.

source: །དགྲ་ཐམས་ཅད་གསད་པ་ལ་ནི་འཁྲུལ་འཁོར་གྱིས་སོ།
en: With the diagram, you kill all enemies.

source: །ནོར་བསྒྲུབ་པར་འདོད་ན་ཛམ་བྷ་ལའི་ཆུ་སྦྱིན་གྱིས་བྱའོ།
en: If you wish to accomplish wealth, perform the water offering to Jambhala.

source: །བགེགས་འཕང་བར་འདོད་ན་ཏིང་ངེ་འཛིན་གྱིས་བྱའོ།
en: If you wish to repel obstacle makers, do so through absorption.

source: །ཐམས་ཅད་འགུགས་པ་ལ་ནི་རྡོ་རྗེ་ལྕགས་ཀྱུས་བྱའོ།
en: With the vajra iron hook, you summon all.
